Revit 2027 API
View.GetReferenceSections Method
 Returns element ids of all reference sections in the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetReferenceSections()
Public Function GetReferenceSections As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetReferenceSections()
member GetReferenceSections : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 Element ids of all reference sections in the view.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace